mirzafahad/hx711_stm32_lib/main.cpp
/******************************************************************************
 * @file    main.cpp
 * @author  Fahad Mirza (fahadmirza8@gmail.com)
 * @brief   Main file
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f4xx_nucleo_144.h"
#include "stdio.h"
#include <stdbool.h>

/* Private define ------------------------------------------------------------*/
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)


/* Private variables --------------------------------------------------------*/
static UART_HandleTypeDef DebugUart;


/* Private functions ---------------------------------------------------------*/
void debug_init(void);
void error_handler(void)


/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
    /* STM32F4xx HAL library initialization:
         - Configure the Flash prefetch, instruction and Data caches
         - Configure the Systick to generate an interrupt each 1 msec
         - Set NVIC Group Priority to 4
         - Global MSP (MCU Support Package) initialization
    */
    HAL_Init();  
  
    // Configure the system clock to 180 MHz
    SystemClock_Config();
  
    debug_init();
  
    HX711 weightScale(GPIOC, GPIOC, GPIO_PIN_6,  GPIO_PIN_7); // Default Gain 128
  
    weightScale.begin();
  
    while(1)
    {
	    int32_t rawdata = weightScale.read();
	    printf("%ld\n", rawdata);
    }
}


/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 180000000
  *            HCLK(Hz)                       = 180000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 8000000
  *            PLL_M                          = 8
  *            PLL_N                          = 360
  *            PLL_P                          = 2
  *            PLL_Q                          = 7
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 5
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
    RCC_ClkInitTypeDef RCC_ClkInitStruct;
    RCC_OscInitTypeDef RCC_OscInitStruct;

    // Enable Power Control clock
    __HAL_RCC_PWR_CLK_ENABLE();

    // The voltage scaling allows optimizing the power consumption when the device is
    // clocked below the maximum system frequency, to update the voltage scaling value
    // regarding system frequency refer to product datasheet.
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    // Enable HSE Oscillator and activate PLL with HSE as source
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState      = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState  = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM      = 8;
    RCC_OscInitStruct.PLL.PLLN      = 360;
    RCC_OscInitStruct.PLL.PLLP      = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ      = 7;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    // Activate the Over-Drive mode
    HAL_PWREx_EnableOverDrive();

    // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
    // clocks dividers
    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
}
  
  
  /**
  * @brief  Initialize debug interface
  * @param  None
  * @retval None
  */
void debug_init(void)
{
	/*##-1- Configure the UART peripheral ######################################*/
	/* Put the USART peripheral in the Asynchronous mode (UART Mode) */
	/* UART configured as follows:
		- Word Length = 8 Bits
		- Stop Bit    = One Stop bit
		- Parity      = None
		- BaudRate    = 921600 baud
		- Hardware flow control disabled (RTS and CTS signals) */
	DebugUart.Instance          = USART3;
	DebugUart.Init.BaudRate     = 921600;
	DebugUart.Init.WordLength   = UART_WORDLENGTH_8B;
	DebugUart.Init.StopBits     = UART_STOPBITS_1;
	DebugUart.Init.Parity       = UART_PARITY_NONE;
	DebugUart.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
	DebugUart.Init.Mode         = UART_MODE_TX_RX;
	DebugUart.Init.OverSampling = UART_OVERSAMPLING_16;

    HAL_UART_Init(&DebugUart);
}


/**
  * @brief  Re-targets the C library printf function to the USART.
  * @param  None
  * @retval None
  */
PUTCHAR_PROTOTYPE
{
    HAL_UART_Transmit(&DebugUart, (uint8_t *)&ch, 1, 5000);

    return ch;
}